---
kind: method
id: M:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.Dispose
source: html/54483ce2-5102-6113-a0ce-77b30b4af3b0.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.Dispose Method

Releases all resources used by the PartMakerMethodToDivideVolumes

## Syntax (C#)
```csharp
public void Dispose()
```